IT_MOL/src/Documents/ПрисвоитьИнвНомер/ПрисвоитьИнвНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоитьИнвНомер</name>
  <registerRecords>InformationRegister.СерийныеНомера</registerRecords>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IT_MOL/src/InformationRegisters/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СерийныеНомера</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IT_MOL/src/Documents/ПрисвоитьИнвНомер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр СерийныеНомера
	Движения.СерийныеНомера.Записывать = Истина;
	Запрос = Новый Запрос();
	ТекстЗапроса = "";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	Для Каждого ТекСтрокаСерийныеНомера из СерийныеНомера Цикл
		Движение = Движения.СерийныеНомера.Добавить();
		Движение.МодельОборудования = Модель;
		Движение.СерийныйНомер = ТекСтрокаСерийныеНомера.СерийныйНомер;
		Движение.ИнвентарныйНомер = ТекСтрокаСерийныеНомера.СерийныйНомер;
	КонецЦикла;

КонецПроцедуры
